tests/fixtures/get-order-no-captures.json

{
  "order_id": "f3392f8b-6116-4073-ab96-e330819e2c07",
  "status": "AUTHORIZED",
  "fraud_status": "ACCEPTED",
  "order_amount": 1000,
  "original_order_amount": 1000,
  "captured_amount": 0,
  "refunded_amount": 0,
  "remaining_authorized_amount": 0,
  "purchase_currency": "usd",
  "locale": "en-us",
  "order_lines": [
    {
      "reference": "75001",
      "type": "physical",
      "quantity": 1,
      "quantity_unit": "pcs.",
      "name": "string",
      "total_amount": 0,
      "unit_price": 0,
      "total_discount_amount": 0,
      "tax_rate": 0,
      "total_tax_amount": 0,
      "merchant_data": "Some metadata",
      "product_url": "https://yourstore.example/product/headphones",
      "image_url": "https://yourstore.example/product/headphones.png",
      "product_identifiers": {
        "category_path": "Electronics Store > Computers & Tablets > Desktops",
        "global_trade_item_number": "735858293167",
        "manufacturer_part_number": "BOXNUC5CPYH",
        "brand": "Intel"
      }
    }
  ],
  "merchant_reference1": "10001",
  "merchant_reference2": "501",
  "klarna_reference": "K4MADNY",
  "customer": {
    "date_of_birth": "1981-09-06",
    "national_identification_number": "string"
  },
  "billing_address": {
    "given_name": "Klara",
    "family_name": "Joyce",
    "title": "Mrs",
    "street_address": "Apartment 10",
    "street_address2": "1 Safeway",
    "postal_code": "12345",
    "city": "Knoxville",
    "region": "TN",
    "country": "us",
    "email": "klara.joyce@klarna.com",
    "phone": "1-555-555-5555"
  },
  "shipping_address": {
    "given_name": "Klara",
    "family_name": "Joyce",
    "title": "Mrs",
    "street_address": "Apartment 10",
    "street_address2": "1 Safeway",
    "postal_code": "12345",
    "city": "Knoxville",
    "region": "TN",
    "country": "us",
    "email": "klara.joyce@klarna.com",
    "phone": "1-555-555-5555"
  },
  "created_at": "2015-11-29T10:25:40.000Z",
  "purchase_country": "us",
  "expires_at": "2015-12-04T10:26:06.000Z",
  "captures": [
  ],
  "merchant_data": "Order metadata",
  "initial_payment_method": {
    "type": "FIXED_AMOUNT",
    "description": "Slice it (Fixed Payments)",
    "number_of_installments": 3
  },
  "selected_shipping_option": {
    "id": "string",
    "name": "string",
    "tms_reference": "string",
    "carrier": "string",
    "type": "string",
    "method": "string",
    "price": 0,
    "tax_amount": 0,
    "tax_rate": 0,
    "location": {
      "id": "string",
      "name": "string",
      "price": 0,
      "address": {
        "street_address": "string",
        "street_address__2": "string",
        "postal_code": "string",
        "city": "string",
        "region": "string",
        "country": "string"
      }
    },
    "timeslot": {
      "id": "string",
      "start": "string",
      "end": "string",
      "cutoff": "string",
      "price": 0
    },
    "carrier_product": {
      "name": "string",
      "identifier": "string"
    },
    "selected_addons": [
      {
        "type": "string",
        "price": 0,
        "external_id": "string",
        "user_input": "string"
      }
    ],
    "class": "string"
  }
}
